# MANEJO DE TABLAS CON PANDAS

In [1]:
import pandas as pd
import numpy as np 
import os

In [2]:
df = pd.read_csv('data_studentlist.csv', header= 'infer') #Para nombrar las listas con el nombre de la primer fila

In [3]:
df.head()

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [4]:
df = df.rename(columns={
    "name": "NAME",
    "age": "AGE"
})
df.head ()

              NAME gender  AGE  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [5]:
df.columns = [col.upper() for col in df.columns]
df.head()

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [6]:
df.columns = [col.lower() for col in df.columns]
df.head()

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [7]:
df = df.add_prefix("prefix_")
df = df.add_suffix("_suf")

df.head()

,prefix_name_suf,prefix_gender_suf,prefix_age_suf,prefix_grade_suf,prefix_absence_suf,prefix_bloodtype_suf,prefix_height_suf,prefix_weight_suf
0,Jared Diamond,M,23,3,Y,O,165.3,68.2
1,Sarah O'Donnel,F,22,2,N,AB,170.1,53.0
2,Brian Martin,M,24,4,N,B,175.0,80.1
3,David Hassel,M,23,3,N,AB,182.1,85.7
4,Clara Rodriquez,F,20,1,Y,A,168.0,49.5

In [8]:
df.columns = ['NAME', 'GENDER' , 'AGE', 'GRADE', 'ABSENCE', 'BLOODTYPE', 'HEIGHT', 'WEIGHT']
df.head()

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [9]:
df['IMC'] = 1000*df['WEIGHT']/df['HEIGHT']**2
df.head()

,NAME,GENDER,AGE,GRADE,ABSENCE,BLOODTYPE,HEIGHT,WEIGHT,IMC
0,Jared Diamond,M,23,3,Y,O,165.3,68.2,2.495966
1,Sarah O'Donnel,F,22,2,N,AB,170.1,53.0,1.831754
2,Brian Martin,M,24,4,N,B,175.0,80.1,2.615510
3,David Hassel,M,23,3,N,AB,182.1,85.7,2.584407
4,Clara Rodriquez,F,20,1,Y,A,168.0,49.5,1.753827

In [10]:
df_left = df.loc[:, ['NAME','AGE', 'GENDER', 'ABSENCE']]
df_right = df.loc[:, ['NAME', 'BLOODTYPE', 'WEIGHT', 'HEIGHT']]

# Unir dataframes

In [11]:
pd.merge(df_left,df_right, left_on="NAME", right_on="NAME", how="inner")

#left
#right
#outer

                NAME  AGE GENDER ABSENCE BLOODTYPE  WEIGHT  HEIGHT
0      Jared Diamond   23      M       Y         O    68.2   165.3
1     Sarah O'Donnel   22      F       N        AB    53.0   170.1
2       Brian Martin   24      M       N         B    80.1   175.0
3       David Hassel   23      M       N        AB    85.7   182.1
4    Clara Rodriquez   20      F       Y         A    49.5   168.0
5   Jennifer Lorentz   21      F       N         O    52.0   162.0
6        Susan Clark   22      F       N         O    45.3   155.2
7    Margareth Jones   23      F       N         A    55.0   176.9
8       John Bertsch   23      M       N         B    64.2   178.5
9     Jake Timmerman   22      M       N         B    61.3   176.1
10     Joshua Connor   24      M       Y         O    62.0   167.1
11      John Matsuda   22      M       N        AB    75.8   180.0
12      Eddy Johnson   21      M       N         A    55.3   162.2
13  Rebecah Anderson   23      F       N         O    53.1   176.1
14      Linda Carter   22      F       N         B    45.2   158.2
15    Richard Swayze   24      M       Y         B    70.2   168.6
16       Andrew King   21      M       N         A    62.2   169.2

In [12]:
df_left_peque = df_left.loc[:10,:]
df_right_peque = df_right.loc[7:,:]

In [13]:
pd.concat([df_left_peque,df_right_peque], sort = True)

   ABSENCE   AGE BLOODTYPE GENDER  HEIGHT              NAME  WEIGHT
0        Y  23.0       NaN      M     NaN     Jared Diamond     NaN
1        N  22.0       NaN      F     NaN    Sarah O'Donnel     NaN
2        N  24.0       NaN      M     NaN      Brian Martin     NaN
3        N  23.0       NaN      M     NaN      David Hassel     NaN
4        Y  20.0       NaN      F     NaN   Clara Rodriquez     NaN
5        N  21.0       NaN      F     NaN  Jennifer Lorentz     NaN
6        N  22.0       NaN      F     NaN       Susan Clark     NaN
7        N  23.0       NaN      F     NaN   Margareth Jones     NaN
8        N  23.0       NaN      M     NaN      John Bertsch     NaN
9        N  22.0       NaN      M     NaN    Jake Timmerman     NaN
10       Y  24.0       NaN      M     NaN     Joshua Connor     NaN
7      NaN   NaN         A    NaN   176.9   Margareth Jones    55.0
8      NaN   NaN         B    NaN   178.5      John Bertsch    64.2
9      NaN   NaN         B    NaN   176.1    Jake Timmerman    61.3
10     NaN   NaN         O    NaN   167.1     Joshua Connor    62.0
11     NaN   NaN        AB    NaN   180.0      John Matsuda    75.8
12     NaN   NaN         A    NaN   162.2      Eddy Johnson    55.3
13     NaN   NaN         O    NaN   176.1  Rebecah Anderson    53.1
14     NaN   NaN         B    NaN   158.2      Linda Carter    45.2
15     NaN   NaN         B    NaN   168.6    Richard Swayze    70.2
16     NaN   NaN         A    NaN   169.2       Andrew King    62.2

In [14]:
pd.concat([df_left_peque,df_right_peque], axis=1, sort = True) #Al poner axis indica sobre cual va a operar

,NAME,AGE,GENDER,ABSENCE,NAME,BLOODTYPE,WEIGHT,HEIGHT
0,Jared Diamond,23.0,M,Y,NaN,NaN,NaN,NaN
1,Sarah O'Donnel,22.0,F,N,NaN,NaN,NaN,NaN
2,Brian Martin,24.0,M,N,NaN,NaN,NaN,NaN
3,David Hassel,23.0,M,N,NaN,NaN,NaN,NaN
4,Clara Rodriquez,20.0,F,Y,NaN,NaN,NaN,NaN
5,Jennifer Lorentz,21.0,F,N,NaN,NaN,NaN,NaN
6,Susan Clark,22.0,F,N,NaN,NaN,NaN,NaN
7,Margareth Jones,23.0,F,N,Margareth Jones,A,55.0,176.9
8,John Bertsch,23.0,M,N,John Bertsch,B,64.2,178.5
9,Jake Timmerman,22.0,M,N,Jake Timmerman,B,61.3,176.1
10,Joshua Connor,24.0,M,Y,Joshua Connor,O,62.0,167.1
11,NaN,NaN,NaN,NaN,John Matsuda,AB,75.8,180.0
12,NaN,NaN,NaN,NaN,Eddy Johnson,A,55.3,162.2
13,NaN,NaN,NaN,NaN,Rebecah Anderson,O,53.1,176.1
14,NaN,NaN,NaN,NaN,Linda Carter,B,45.2,158.2
15,NaN,NaN,NaN,NaN,Richard Swayze,B,70.2,168.6
16,NaN,NaN,NaN,NaN,Andrew King,A,62.2,169.2

In [15]:
columnas = ['A', 'B', 'C']
indice_out = ['G1']*2 + ['G2']*2 + ['G3']*2
indice_in = ['a', 'b']*3

# Lista de Tuplas

In [16]:
indice_zip = list(zip(indice_out,indice_in))
indice_zip

[('G1', 'a'), ('G1', 'b'), ('G2', 'a'), ('G2', 'b'), ('G3', 'a'), ('G3', 'b')]

## Crearemos un multiindex desde las tuplas

In [17]:
multi_indice = pd.MultiIndex.from_tuples(indice_zip)
df = pd.DataFrame(data=np.random.rand(6,3), index=multi_indice,columns=columnas)
df

             A         B         C
G1 a  0.618789  0.765211  0.772536
   b  0.243524  0.909614  0.098021
G2 a  0.698141  0.979509  0.395440
   b  0.630277  0.131013  0.538474
G3 a  0.034901  0.535251  0.171760
   b  0.456915  0.710006  0.029110

In [20]:
df.loc['G1']  #Traer un grupo en especfico

          A         B         C
a  0.618789  0.765211  0.772536
b  0.243524  0.909614  0.098021

In [21]:
df.loc['G1'].loc['a'] # Traer fila en particular

A    0.618789
B    0.765211
C    0.772536
Name: a, dtype: float64

In [22]:
df.loc['G1'].loc['a','B'] # Traer fila en particular y columna, o sea un valor

np.float64(0.7652107656291414)

### Usaremos un dataframe llamado df1

In [23]:
df1 = pd.read_csv('data_studentlist.csv', header= 'infer')

### Agrupamos por Gnero, luego por tipo de sangre y calculamos el promedio de altura

In [24]:
sr = df1.groupby(['gender','bloodtype'])['height'].mean()
sr

gender  bloodtype
F       A            172.450000
        AB           170.100000
        B            158.200000
        O            164.433333
M       A            165.700000
        AB           181.050000
        B            174.550000
        O            166.200000
Name: height, dtype: float64

# Tabla pivote

Es una forma de visualizar ordenamente una tabla, reorganiza las tablas en una forma sencilla de entender

In [27]:
my_dict = {"Size": ["L", "L", "M", "M", "M", "S", "S", "S", "S"],
           "Type": ["A", "A", "A", "B", "B", "A", "A", "B", "B"],
            "Location": ["L1", "L1", "L1", "L2", "L2", "L1", "L2", "L2", "L1"],
            "A": [1, 2, 2, 3, 3, 4, 5, 6, 7],
            "B": [2, 4, 5, 5, 6, 6, 8, 9, 9]}
df = pd.DataFrame(my_dict)
df

  Size Type Location  A  B
0    L    A       L1  1  2
1    L    A       L1  2  4
2    M    A       L1  2  5
3    M    B       L2  3  5
4    M    B       L2  3  6
5    S    A       L1  4  6
6    S    A       L2  5  8
7    S    B       L2  6  9
8    S    B       L1  7  9

In [29]:
dfr = pd.pivot_table(df, index=['Size','Type'], columns='Location',values='B') #  (dataframe, indices, columnas, valores)
dfr

Location    L1   L2
Size Type
L    A     3.0  NaN
M    A     5.0  NaN
     B     NaN  5.5
S    A     6.0  8.0
     B     9.0  9.0